{
  "title": "Who and Why of my 2016 Presidential Vote",
  "date": "20161107",
  "body": [
    {
      "content": [
        "On social media, Ive been an advocate against voting. Most recently, I made a post about Arrows Theorem, which suggests that voting is a bad mechanism for making decisions on behalf of a group. Before Ive argued that no one has a good reason to vote, because the reasonable expected probability of influencing the outcome of an election is virtually 0%. Ive said that voting is as rational as playing the lottery, no positive expected outcome and non-zero costs of playing. Less clearly, Ive said that voting represents the worst in people. Anyone who sincerely wanted to make the world a better place, would not do so by voting. Most everyone who is voting is doing so with bad intentions, and prejudiced judgement. People who are hostile and tribal self-select themselves as voters",
        "There have been a few silent asterisks in my arguments. True, one cant expect to make any difference in an election, but there are conceivably good non-consequentialist reasons to vote. Yes, bad intentions are over represented among voters, but this only establishes that voting isnt that virtuous. A lot of bad people voting for bad reasons doesnt establish that one should never vote, just that voting isnt really something that we should be celebrating."
      ],
      "type": "normal"
    },
    {
      "content": [
        "Because Ive said all of those things, I feel a bit obligated to share that I voted for libertarian candidate Gary Johnson in this election. I didnt vote to make the world a better place- such a supposition is nonsense since a vote cant make the world a better place. I voted the only way I think one should, which is towards a candidate one sincerely believes in, with no consideration of 'spoilers'. I voted because my dad would be happy to see me do so, and more generally, voting lets me socialize with other voters. Making symbolic committments is part of a social life, and I like having a social life. Ive come to learn that people expect that kind of thing."
      ],
      "type": "normal"
    },
    {
      "content": [
        "Tho I know plenty of people voting for Trump, and Ive had a lot of fun saying 'Make America Great Again!', I did not vote for Donald Trump. I decided not to do so not because I disagreed with what few policy preferences hes reliably articulated- I think the wall is a great idea, for example. I did not vote for Trump, because I think he failed to demonstrate the basic character necessary for the office."
      ],
      "type": "normal"
    }
  ]
}