{
  "title": "Some Health Care Solutions",
  "date": "20161208",
  "body": [
    {
      "body": [
        "In my previous post on health care, 'Some Problems with Health Care', I covered some of the economic problems implicit in how the United States allocates helath care. In this post, I would like to talk about what different nations have done to solve those problems.",
        "In this post, we will make the single payer system a central focus, and then compare other systems to it. In my previous post, I made it clear that the problems in the US health care system are basically economic, revolving around costs. The moral problem of getting health care to the poor is solved by existing welfare services. Currently in the United States, everyone has health care, except for a good chunk of healthy middle class people who find it too expensive.",
        "There are economic forces that have made the prices for health care high. Regardless as to how you might explain those forces (say, whether they are natural or unnatural, or whether the government or corporations are to blame), one might counteract those economic forces with opposite economic forces that lower costs. Free-markety types will reasonably doubt whether economic forces can truly negate each other; theyll suggest that if costs are depressed artificially, they will just re-express themselves in somewhere else in the economy. Lets put that valid point aside, and simplify the task of solving health care to a simple aim of lowering costs."
      ],
      "type": "normal"
    },
    {
      "body": [
        "The single payer system induces an economic force to reduce prices. That force, is the result of what economists call a monopsomy, which is very similar to a monopoly. Im going to presume you know what a monopoly is, and that you know when a seller has a monopoly they can set their prices higher because of their relatively strong market position. In a monopoly circumstance, buyers arent necessarily screwed like the common connotionation of the word suggests; buyers just arent getting the level of benefit they would get in a competitie market. A monopsomy is just like a monopoly, except that rather than there being a single seller in a market, there is only a single buyer. A single buyer, just like a singler seller, also has a relatively strong market positions, and therefore can command prices lower (since they would like to pay less). Since a single buyer is the only buyer, it determines the entire demand for what it buys.",
        "The single payer system is one in which the government is the only buyer of health care oe health insurance, and is therefore a monopsomy. Because the government is the only buyer, it commands prices lower than they otherwise would be. The government could presumably dictate a price of zero, but they dont because they know that it wouldnt do anyone any good if no one could afford to do business with the government. The recipients of health care arent really paying anything directly, altho they do pay for the single payer program in their taxes."
      ],
      "type": "normal"
    },
    {
      "body": [
        "Many different governments have implemented health care solutions that resemble the single payer system in its basic strategy of setting prices. In Japan, the government has a committee that sets the prices of health care goods. People are still free to buy and sell, albiet only at the prices the government sets. Like through the single payer system, Japans government seeks to forcibly set prices lower, but unlike the single payer system it doesnt take the task upon itself to buy anyones health care or insurance.",
        "The system in the UK is more invasive than the single pay system. UK has basically nationalized all health care. Almost all doctors in the UK are employed by, or contract with the state. Its very bureacratic too: its against the law to consult a doctor directly, instead one has to get a referal from a specialized government officer who assesses your health care needs. The single payer system takes over the demand side of the health care industry, in the UK the government has taken over the supply side too.",
        "In Germany, things operate basically as they do in a single payer system, but with a mechanism that resembles the US social security system. By law, people have to make payments into a single collective government insurance pool, and when they get sick they can draw from that pool. It works the same way as a single payer system, but people pay into the system seperately rather than as an unlisted component of their over all taxes. Because its a distinct pool of money, the program is liable to sustainability questions if people draw more from it than they put in (just like social security in the United States)."
      ],
      "type": "normal"
    },
    {
      "body": [
        "Id like to give a tentative assessment of the single payer system. For the purpose of comparison, I would say that in the United States, we have excellent quality health care, that is unfortunately immensely expensive and inaccessible. In a single payer system, health care is good, affordable, and accessible to everyone. The losers in a single payer system are rich people, really unhealthy people who need specialized medicine, and people who dont care about their health. The winners are the far larger group of normal people who who have normal health care needs. Garaunteeing that everyone has affordable basic health care, even if it comes at the cost of market freedom and economic efficiency is a pretty easy argument for most people, myself included. The overall benefit from affordability and accessibility justifies the program.",
        "However, I do think that there is a neglected argument for freedom in the health care discussion. The single payer system indirectly forces people to buy health care, and therefore violates economic freedom. Obamacare, in an even more direct manner, forces people to buy health care. If we are picking between systems that violate basic economic freedoms, at least the single payer system indisputably works. Law the permits the government to force everyone to purchase health insurance to make people healthier, is dangerous as a constitutional matter. I dont expect everyone to care about freedom, but considering that many people do, everyone concerned should at least try to appeal to the moral value of freedom. Like most political problems, I believe that we can solve our health care problems and make everyone happy at the same time. Most problems only seem like zero sum power struggles; they often arent. At the very least, a list of possible health care policies can be ranked by how much they violate economic rights."
      ],
      "type": "normal"
    },
    {
      "body": [
        "In my previous post, I noted some of the basic economic problems in the health care insurance industry. I find it interesting, that none of the worlds health care systems appear to eliminate these problems, rather, they try and reverse them or mitigate them. Costs go up for reasons, and so long as those reasons exist they will push costs higher. Rather than removing the reasons (causes) of our health problems, nations just push the costs down artificially. This works well enough, but it makes me wonder if there is a different path to good health care that no nation has explored yet: one that actually eliminates the economic problems directly.",
        "What were those problems? Well I listed two in my previous post: 0 health insurance is being used to buy health care, which violates the definition and purpose of health care; and 1, unhealthy people cost more to take care of, and health people wont pay unhealthy-person prices if given the option. Given these problems, our wish to make everyone happy, let me share some features of a hypothetical fantasy system:",
        "(A) Insurers are legally constrained in what they can provide in their insurance plans. Insurers cant sell insurance that pays for medical services, prescription drugs, dental, check-ups, or preventative medicine. Those things are all great, but they arent the sorts of things that insurance should provide. In my system, insurance has to be cash payments to people who suffer big unexpected health problems.",
        "(B) Providers can sell health care and health insurance to who ever, for whatever price. Providers can discriminate on pre-existing conditions. People vary in their health, and they therefore vary in how much they cost insurers, and forbidding insurers to price discriminate doesnt help the sick, rather it just makes things too expensive for the healthy.",
        "(C) We have a basic welfare system that provides basic medical services. The government promises everyone the option to go to a doctor and get basic care like medical advice, medicine, preventative care. Basic care isnt going to save you if you get cancer or a heart attack, but it will give everyone the opportunity to live in a healthy way.",
        "In my fantasy system, everyone pays less than they do now, which I think is great, but in order to work healthy people have to pay healthy-person prices and unhealthy people have to pay unhealthy-person prices. To freedom extremists, people paying how much they cost sounds like justice, but I know that price discrimination is an unpopular notion (well sort of, theres lots of popularly accepted price discrimination: senior discounts, veteran discounts, female discounts at night clubs). So long as people cant accept discrimination on pre-existing conditions, we will be stuck with health care problems that can only be solved by enormous invasive government programs, which truth be told, arent really that bad in the first place."
      ],
      "type": "normal"
    }
  ]
}