{"title":"Legal Interpretation by Intent","date":"20170707","body":[{"content":["Consider the text book philosophy of law example, a law that says \"no vehicles in the park\". If you interpret this law literally, it would forbid an ambulance from entering the park. No one likes that idea. To escape that conclusion, some turn away from literal interpretation and instead to the intent behind the law, but there too the law forbids the ambulance: if the law was meant to keep down noise pollution, an ambulance siren still violates the intent, and therefore the law.","In this case, interpretting law according to its intent doesnt help us shirk the responsibility of interpretting words literally. Interpretting law by its intent is a fun theory, so in this blog post Ill consider other circumstances that interpretation by intent doesnt help. Disclaimer, I will not be totally fair to the theory in this post."],"type":"normal"},{"content":["Suppose the law \"no vehicles in the park\" was enacted by a legislature with 100% of the vote. The legislature has two parties. One party wanted to reduce noise pollution. The other party wanted to protect the grass in the park. As someone who is interpretting the law, which intention do you defer to? Neither? Both? ","What if in a different example, the intents are less compatible and actually conflict? Suppose there is a law that bans air pollution. Everyone votes in favor. One half of the legislature votes yes to get clean air. The other half couldnt care less about air pollution, and votes yes for force new technology to replace the old air pollution technology. Suppose a new super great technology is developed as an alternative to air polluting technology, but its later discovered to violate the law after a closer examination of what counts as air pollution. Do you apply the law against users of the technology, or not? The two intents give contradicting conclusions."],"type":"normal"},{"content":["Suppose there is a law thats just really poorly written and doesnt make much sense to any reader. Suppose that despite its poor quality, there is a really clear congressional record, and everyone in congress is on record saying \"I am voting for this to protect the grass in the park\". Since you have a complete record of the intent behind the law, you should have everything you need to interpret the law, right?","Take this to the extreme, suppose congress is absolutely insane and votes on a law that is just a piece of paper with \"A\" written on it. Suppose again that you have a complete record of what congress wanted to accomplish with this law. Since its the intent that matters and not the text, you are still able to interpret the law just fine. ","Unless there is something wrong with this, and there probably is, whats stopping congress from giving up on articulate legal content entirely? Laws could come from blank pieces of paper that congress votes on after recorded discussion sessions."],"type":"normal"},{"content":["Suppose its the 19th century and you are a judge in San Fransisco. There are a lot of poor chinese immigrants in your city, and they dominate the laundry industry. The local legislature enacts a law that makes it illegal to run a laundry business at night, which the chinese immigrants usually do. You are a progressive judge, so you are happy to see laws that restrict working hours, because its unfair and exploitive for laundry workers to have to work all day and all night. You arent an idiot tho, and you know that the San Fransiscan legislature doesnt care about work hours. You know that the legislature is made up of anti-chinese racists who just want to make the lives of chinese immigrants miserable, as they certainly would be without those economic freedoms. As a political progressive, you think the consequence is a blessing for the chinese, but you know the intent is horrible. Sadly, being a good judge committed to legislative intent, you must block the law because of its illegal intent."],"type":"normal"},{"content":["At the beginning I gave a warning that I wasnt going to be totally fair. Often when jurists defer to the intent behind a law, they are defering to what the legislatures would have wanted in this case, not exactly what they did intend. But isnt that an obvious mistake? If the intent behind \"no vehicles in the park\" is \"lets reduce noise pollution\", an ambulance violates that intent, even if the legislature wouldnt have wanted to obstruct emergency services. You could say they didnt intend to obstruct emergency services, but so what? What they didnt intend, is not the intention behind the law. Nor was the intention to not obstruct emergency services. \"Interprettion by the intent held by the legislature in enacting the law\", and \"interpretion by intent held by a hypothetical legislature if it was deciding a particular case\" are two inconsistent legal theories."],"type":"normal"}]}