{"title":"Health causes Diet and Exercise","date":"20170729","body":[{"content":["A little while back I ran a twitter poll asking \"Am I crazy for thinking that lifestyle choices like diet and exercise have no impact on long term health?\". The results were 4 yes, 0 no. I dont think I can convince anyone that these lifestyle choices dont have any impact, but I would like to try and argue thats its not crazy. Now, I cant write out what I believe to be the full truth in one blog post, but I think I can give a good explanation for my view with uncontroversial reasoning.","To be clear, I am not talking about every conceivable lifestyle choice. I can concede that there are some possible lifestyle choices that are deleterious to ones long term health. Smoking and heavy drinking come to mind. Those particular things arent my focus, but diets will be. And also to be clear, I am talking about long term health specifically. By \"long term health\", I mean the stuff that will lead to your death, and therefore is a huge determinant of your longevity. I am talking about heart disease, cancer, diabetes, strokes and the like. I dont mean the kind of health that makes you feel good or able to perform well athletically.","Really I just want to talk about diet and exercise, and I will take each of those one at a time; starting with exercise."],"type":"normal"},{"content":["Before we get into the research on exercise, lets talk about makes sense. The idea that exercise causes good health is common, but its not really coherent with what we generally think about bodily activity. Stuff that gets worn out doesnt work as well, so why would wearing out your body add to longevity? You probably have an answer to that question, and whatever that answer may be, I just ask you to admit that any explanation for how the very epitome of wearing out your body leads to it becoming the opposite of worn out is counter-intuitive, and should therefore be met with skepticism. Im sure you have an answer that makes sense, but such is the character of wrong answers.","This isnt just a matter of intuition either. Biologists who study longevity often model longevity as a function of the body wearing out over time. Such wear and tear is inevitable, even if the body repairs itself: when the body repairs itself, the repair mechanism itself gets worn out and gradually gets worse at repairing. ","Dont think about this too hard, what wears bodies out? Heart beats, metabolism, and energy consumption; that kind of stuff. Those are exactly the sorts of things exercise is associated with. Again, we should find it peculiar that exercise increases longevity.","The good high quality studies out there- the ones that find correlations between health and exercise- are written by scientists modest enough to say we dont know if exercise is causative. It could be the other way around for all we know. Maybe health causes exercise, and why wouldnt it? Dont you need health to exercise? Think about our understanding of \"wearing out\" and longevity from the previous paragraph. Worn out bodies move less. Worn out bodies sleep and rest, and are therefore inactive. Worn out bodies, are by definition less capable of moving. Someone who is unhealthy is less capable of exercising. Someone who is unhealthy probably doesnt enjoy exercising. Someone who is healthy, likely has the time and energy and wherewithal to commit several hours a week to exercise, or any hobby really. If any of these associations are real (they seem somewhat undeniable) a correlation would show up in the data. The data is therefore consistent with health causing exercise."],"type":"normal"},{"content":["So what does the data say exactly about exercise and longevity? Well, people who exercise live 3 years longer than average. Whats weird, is those 3 more years are earned with every level of exercise. What I mean is, if you do light aerobics for 20 minutes a day you get 3 more years. If you are a professional athlete who pushes their body to the limit and trains every day, you also get three more years. Everything in between these extremes is also about 3 more years. If it mattered, you would think it matters in degree with the amount of exercising, but it apparently doesnt. I can think of other ideas that are consistent with a 3 year longeivty return on every level of exercise. Maybe people who exercise demonstrate some minimimum level of discipline and that discipline causes longevity in some other indirect way. Maybe everyone without discipline are more likely to get in car accidents, or they eat lots of sugar and that hurts their health. If any of these things were the true cause, and exercise was correlated with it, then exercise would show up in the data correlated with health.","And lots of things have similar returns on longevity, which statistically suggests that exercise cant matter too much in the grand scheme of things. Doing good on the SAT exam gives you about 3 years on someone who did just okay. Strangely, doing good on the SAT while being obese gives you longevity over obese people who dont do well on the SAT. Being about 40% higher on the income distribution gives you 3 years. You could suppose thats because rich people can afford healthcare, but actually, when you control of medical expenses, healthcare spending has no impact on longevity.","Here again, health is plausibly causal, not the other way around. Dont you think healthy people do better in school and can make better choices regarding their own health? Do you think healthy people perform better at their job, and make more money? Do you think healthier people, who generally have a good life outcome, have more opportunity to exercise than someone who doesnt? Again, this makes at least as much sense as supposing it works the other way around.",""],"type":"normal"},{"content":["Now regarding diets, there is less to say. Everyone thinks diets matter, but no one can definitively tell you which diets are good. When experts like nutritionists and doctors are surveyed about foods, and asked if this or that particular food is good for you, they give answers that are just as diverse as those given by normal people. Usually we should defer to experts, but in this case, the expected answer from an expert is the same as that of someone who isnt an expert. Not only that, but every possible answer is given in roughly the same frequency. Maybe someone has correct beliefs on good dieting, but how could you know who has the correct answer? You have to have some basis for defering to some opinion or another, and there just isnt any. There is empirical evidence supporting and refuting every diet. You would think there would be some concentration of ideas among some groups of people, but there arent. Across time too, dieting wisdom has changed pretty dramatically, even in recent history. I bet it will change again. If dieting did matter, it wouldnt be like this. Something would stand out.","I think much of the reasoning we went through regarding exercise can be applied to diets too. People who diet are healthier, but not because of the diet. People who have the money, discipline, and the fashion sense to commit to a diet are healthier. It takes health to be able to do those things. People who are unhealthy dont have the luxury to live weird lifestyles like refusing to eat particular classes of food. Healthy people do better in life, and make more money, and can buy food to arbitrary standards like \"organic\". Disciplined people live good healthy lives generally, and seperately, are also capable of sticking to any arbitrary food restriction. "],"type":"normal"}]}