{"title":"Understanding Ancient Life Expectancy","date":"20180101","body":[{"content":["I like social science stuff, including anthropology, so frequently enough I read comments about the life expectancy of this or that group of people. The comments Ive heard on life expectancy often indulge a certain fallacy I would like to tackle in this blog post. Lets see if it works."],"type":"normal"},{"content":["What fallacy am I talking about? Youve probably heard some comment about the life expectancy of some ancient group of people being astonishingly low (for example, hunter gatherers or pre-industrial people only living to ~35 years old). Those comments are usually literally true, and life expectancy really was that short for more of human history. The fallacy however, is suggesting that life expectancy is a normal age people actually die at, which really hasnt ever been the case. In most every population where life expectancy is or was astonishingly low, the people in those populations usually lived to ages well beyond life expectancy- much closer to modern life expectancy. What I am saying is that if you went back in time to somewhere like mideval England, where life expectancy was around 35 years, and you went about meeting random mideval English people, most of those people would probably live into their 70s."],"type":"normal"},{"content":["How could that be? Think about how life expectancy is calculated. Its an average of all ages of death. For almost all of human history, a large majority of people either die shortly after birth or at a very old age. The first group usually dies at about 2 years old, and the second group at around 72 years old. The average of those two ages is around 35. In a population where everyone dies as an infant or as an elderly person, no one dies at 35, and 35 is not a representative age of death of anyone, and its still the life expectancy because its the average.","","The confusion comes about from the use of the word \"expectancy\". In statistics, expected usually means average, but average values can be unlikely or even impossible values. For example, the fertility rate is an expected value, but its also a decimal value and its impossible to give birth to a decimal number of children. No woman gives birth to 2.3 kids, but that is the number you get when you average the number of children women give birth to. ","","The topic is further confused by the fact that when we talk about this or that group of people, we have in mind the people who are or were alive and going about their business. The group of people-who-actually-went-about-their-business just a completely different group from the people who were ever born. Infants account for maybe 60% of the people who died, but only 3% of people who were alive at any given time. So the composition of the groups \"people who were alive at period X\" and \"people who died around period X\" are totally different. Since the human population has always always largely adults, the reasonable non-statistical expectation for nearly all living people was to live to become elderly."],"type":"normal"},{"content":["Dont read too much into what I am saying. Im not trying to equivicate ancient and modern peoples. I am just saying that on this specific fact, people are really confused. Generally speaking I think ancient peoples lived really hard lives that involved a lot of manual labor and homicide. Because life was brutal in ancient times, and homicide was a feature of human life, I think the number of people who died around 35 was much higher in the past than today. Still, even at this higher rate, 35 wasnt a normal age of death."],"type":"normal"}]}
